# WORKING WITH TEXT FILE

In [1]:
import pandas as pd

In [19]:
df = pd.read_csv("penguins.csv").dropna(how="all")
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [ ]:
#remove dollar sign
#modify the name with comma

# STRING METHOD

In [5]:
"hello World".lower()

'hello world'

In [6]:
"hello World".upper()

'HELLO WORLD'

In [9]:
len("hello World")

11

In [8]:
"hello World".title()

'Hello World'

In [11]:
df["species"].str.upper()

0      ADELIE
1      ADELIE
2      ADELIE
3      ADELIE
4      ADELIE
        ...
339    GENTOO
340    GENTOO
341    GENTOO
342    GENTOO
343    GENTOO
Name: species, Length: 344, dtype: object

In [12]:
df["species"].str.title()

0      Adelie
1      Adelie
2      Adelie
3      Adelie
4      Adelie
        ...
339    Gentoo
340    Gentoo
341    Gentoo
342    Gentoo
343    Gentoo
Name: species, Length: 344, dtype: object

In [14]:
df["sex"] = df["sex"].str.title()

In [15]:
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [16]:
df["island"].str.len() # to see the len of values in every rows of that column

0      9
1      9
2      9
3      9
4      9
      ..
339    6
340    6
341    6
342    6
343    6
Name: island, Length: 344, dtype: int64

In [17]:
"Hello World".replace("l", "!")

'He!!o Wor!d'

In [22]:
df["island"]= df["island"].str.replace('Biscoe', 'Biscoep') #replace with correct spell

In [23]:
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...
339,Gentoo,Biscoep,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoep,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoep,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoep,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoep,49.9,16.1,213.0,5400.0,MALE

In [ ]:
#remove dollar sign converting into float
#df["island"]= df["island"].str.replace('$', '').astype(float)
# then we can conduct analysis
#see the largest number
#df["island"].nlargest()